Revit 2026 API

# MultiServerServiceGetActiveServerIds(Document) Method

---

Returns Ids of the servers currently applicable to the given document for the service.

**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Guid> GetActiveServerIds(
	Document document
)
```
```vb
Public Function GetActiveServerIds (
	document As Document
) As IList(Of Guid)
```
```cpp
public:
IList<Guid>^ GetActiveServerIds(
	Document^ document
)
```
```fsharp
member GetActiveServerIds :
        document : Document -> IList<Guid>
```

#### Parameters

document Document
     The associated document.

#### Return Value

IListGuid A set of GUIDs of the document-applicable active servers; the list may be empty.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The Ids would be of all the servers explicitly assigned to the specified document.

#### Reference

MultiServerService Class

GetActiveServerIds Overload

Autodesk.Revit.DB.ExternalService Namespace